tutorials/heatTransfer/buoyantPimpleFoam/hotRoom/0/T.org
/*------------------------------*- FOAMDict -*-------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    floor           
    {
        type            fixedValue;
        value           uniform 300;
    }

    ceiling         
    {
        type            fixedValue;
        value           uniform 300;
    }

    fixedWalls      
    {
        type            zeroGradient;
    }
}

// ****************** vim: set ft=foamdict sw=4 sts=4 et: ****************** //
